Tekla Open API Reference for Tekla Structures 2025
ImageListComboBox Class
 The ImageListComboBox class represents a combo box control that can contain images from an ImageList control.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 Tekla.Structures.Dialog.UIControls.ImageListComboBox
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class ImageListComboBox : UserControl
Public NotInheritable Class ImageListComboBox
	Inherits UserControl
The ImageListComboBox type exposes the following members.
Constructors
Name | Description
ImageListComboBox
 Initializes a new instance of the ImageListComboBox class.
Top
Properties
Name | Description
DefaultValue
 Gets or sets the default value in the image combo box. If the value is not found, SelectedItem is used instead.
HoverColor
 Gets or sets the hover color of the combo box.
ImageList
 Gets or sets the ImageList that contains the images to be displayed in the combo box. Recommended image file formats are JPG and BMP.
SelectedIndex
 Gets or sets the selected index of the image in the image combo box.
SelectedItem
 Gets or sets the selected image in the image combo box. If the image is not found, SelectedIndex is used instead.
ToolTipText
 Gets or sets the tool tip text.
Top
Methods
Name | Description
RefreshOptionList
 Refreshes the option list content.
Top
Events
Name | Description
ImageListComboBoxMouseWheel
 The ImageListComboBoxMouseWheel event is triggered just after the mouse wheel has been activated on top of the combo box.
ImageListComboBoxSelectedIndexChanged
 The ImageListComboBoxSelectedIndexChanged event is triggered just after the selected index has been changed in the image combo box.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace